
import random

answer = ["абрикосы(р.п)", "ананасы(р.п)", "апельсины(р.п)", "баклажаны(р.п)", "бананы(р.п)", "гранаты(р.п)", "лимоны(р.п)", "мандарины(р.п)", "патиссоны(р.п)", "помидоры(р.п)",
          "томаты(р.п)", "дыни(р.п)", "сливы(р.п)", "яблоки(р.п)", "бухгалтер", "возраст", "выговор", "грифель", "диспетчер", "договор", "драйвер", "инженер",
          "инструктор", "инспектор", "компрессор", "конструктор", "контейнер", "корректор", "лекарь", "месяц", "плеер", "полис", "порт", "почерк", "прожектор", "пудель",
          "редактор", "ректор", "свитер", "склад", "слесарь", "слог", "снайпер", "столяр", "табель", "токарь", "торт", "трактор", "тренер", "флигель", "фронт", "шофёр",
          "адрес", "вексель", "ворох", "директор", "доктор", "катер", "китель", "колокол", "кузов", "купол", "кучер", "окорок", "округ", "ордер", "паспорт", "повар", "погреб", "профессор",
          "пояс", "сорт", "стог", "сторож", "тенор", "терем", "тополь", "фельдшер", "флюгер", "хутор", "штабель", "штемпель", "якорь", "корпус(туловище)", "корпус(здание)", "лагерь(группировки)",
          "лагерь(туристический)", "муж(государственный)", "муж(семья)", "зуб(биология)", "зуб(пила)", "пропуск(пробел)", "пропуск(документы)", "орден(рыцарский)", "орден(награда)", "образ(художественный)",
          "образ(икона)", "тон(звук)", "тон(оттенок)", "хлеб(пища)", "хлеб(злаки)", "дно", "курица", "человек", "ребенок", "полено", "бахилы(р.п)", "ботинки(р.п)", "бутсы(р.п)", "брюки(р.п)",
          "валенки(р.п)", "гетры(р.п)", "кальсоны(р.п)", "кастаньеты(р.п)", "кроссовки(р.п)", "мокасины(р.п)", "панталоны(р.п)", "погоны(р.п)", "сапоги(р.п)", "тапки(р.п)", "туфли(р.п)",
          "чулки(р.п)", "шаровары(р.п)", "шорты(р.п)", "эполеты(р.п)", "бриджи(р.п)", "гольфы(р.п)", "джинсы(р.п)", "клипсы(р.п)", "лампасы(р.п)", "носки(р.п)", "рельсы(р.п)",
         "армяне", "башкиры", "болгары", "буряты", "грузины", "лезгины", "осетины", "румыны", "татары", "турки", "туркмены", "цыгане", "монголы",
          "таджики", "хорваты", "якуты",
          "блюдце(р.п)",
          "зеркальце(р.п)", "копытце(р.п)", "одеяльце(р.п)", "полотенце(р.п)", "сердце(р.п)", "щупальце(р.п)",
          "болотце(р.п)", "деревце(р.п)", "оконце(р.п)", "гардемарины(р.п)", "гренадеры(р.п)", "гусары(р.п)", "драгуны(р.п)", "кадеты(р.п)",
          "партизаны(р.п)", "солдаты(р.п)", "уланы(р.п)", "саперы(р.п)", "бегунья(р.п)", "гнездовье(р.п)",
          "запястье(р.п)", "кушанье(р.п)", "надгробье(р.п)", "ожерелье(р.п)", "оладья(р.п)", "отродье(р.п)", "печенье(р.п)", "плясунья(р.п)", "побережье(р.п)",
          "поверье(р.п)", "подземелье(р.п)", "сиденье(р.п)", "соленье(р.п)", "увечье(р.п)", "ущелье(р.п)", "верховье (р.п)", "коренья (р.п)", "лохмотья (р.п)", "низовье (р.п)", "платье (р.п)",
          "подмастерье (р.п)", "угодья (р.п)", "устье (р.п)", "хлопья (р.п)", "ружьё (р.п)", "ладья (р.п)", "копьё (р.п)", "амперы (р.п)", "аршины (р.п)", "байты (р.п)", "ватты (р.п)", "вольты (р.п)", "децибелы (р.п)",
          "граммы (р.п)", "гектары (р.п)", "килограммы (р.п)", "бредни (р.п)", "будни (р.п)", "гантели (р.п)", "доли (р.п)", "дяди (р.п)", "злыдни (р.п)", "кегли (р.п)", "козни (р.п)", "ладони (р.п)", "простыни (р.п)", "распри (р.п)", "скатерти (р.п)",
          "тёти (р.п)", "чукчи (р.п)", "ясли (р.п)", "баржи (р.п)", "басня (р.п)", "башня (р.п)", "брызги (р.п)", "вафля (р.п)", "дело (р.п)", "копна (р.п)", "кочерга (р.п)", "кухня (р.п)", "макароны (р.п)", "манжета (р.п)", "няня (р.п)", "петля (р.п)",
          "сабля (р.п)", "серьга (р.п)", "сплетня (р.п)", "туфли (р.п)", "цапля (р.п)", "шпроты (р.п)", "яблоня (р.п)", "бронхи (р.п)", "георгины (р.п)", "дебаты (р.п)", "заморозки (р.п)", "консервы (р.п)", "нервы (р.п)", "комментарии (р.п)", "сумерки (р.п)", "сосиски (р.п)", "штиблеты (р.п)", "колики (р.п)"]



questions = ["абрикосов", "ананасов", "апельсинов", "баклажанов", "бананов", "гранатов", "лимонов", "мандаринов", "патиссонов", "помидоров", "томатов", "дынь", "слив", "яблок",
          "бухгалтеры", "возрасты", "выговоры", "грифели", "диспетчеры", "договоры", "драйверы", "инженеры", "инструкторы", "инспекторы", "компрессоры", "конструкторы",
          "контейнеры", "корректоры", "лекари", "месяцы", "плееры", "полисы", "порты", "почерки", "прожекторы", "пудели", "редакторы", "ректоры", "свитеры", "склады", "слесари",
          "слоги", "снайперы", "столяры", "табели", "токари", "торты", "тракторы", "тренеры", "флигели", "фронты", "шофёры", "адреса", "векселя", "вороха", "директора", "доктора", "катера",
          "кителя", "колокола", "кузова", "купола", "кучера", "окорока", "округа", "ордера", "паспорта", "повара", "погреба", "профессора",
          "пояса", "сорта", "стога", "сторожа", "тенора", "терема", "тополя", "фельдшера", "флюгера", "хутора", "штабеля", "штемпеля", "якоря", "корпусы", "корпуса", "лагери", "лагеря", "мужи", "мужья",
          "зубы", "зубья", "пропуски", "пропуска", "ордены", "ордена", "образы", "образа", "тоны", "тона", "хлебы", "хлеба", "донья", "куры", "люди", "дети", "поленья", "бахил", "ботинок", "бутс", "брюк",
          "валенок", "гетр", "кальсон", "кастаньет", "кроссовок", "мокасин", "панталон", "погон", "сапог", "тапок", "туфель",  "чулок", "шаровар", "шорт", "эполет", "бриджей", "гольфов", "джинсов",
          "клипсов", "лампасов", "носков", "рельсов", "армян", "башкир", "болгар", "бурят", "грузин", "лезгин", "осетин", "румын", "татар", "турок", "туркмен", "цыган", "монголов","таджиков", "хорватов", "якутов",
          "блюдец", "зеркалец", "копытец", "одеялец", "полотенец", "сердец", "щупалец", "болотцев", "деревцев",
          "оконцев", "гардемарин", "гренадер", "гусар", "драгун", "кадет", "партизан", "солдат", "улан", "саперов", "бегуний", "гнездовий",
          "запястий", "кушаний", "надгробий", "ожерелий", "оладий", "отродий", "печений", "плясуний", "побережий", "поверий", "подземелий",
          "сидений", "солений", "увечий", "ущелий", "верховьев", "кореньев", "лохмотьев", "низовьев", "платьев",
          "подмастерьев", "угодьев", "устьев", "хлопьев", "ружей", "ладей", "копий", "ампер", "аршин", "байт", "ватт", "вольт", "децибел",
          "граммов", "гектаров", "килограммов", "бредней", "будней", "гантелей", "долей", "дядей", "злыдней", "кеглей", "козней", "ладоней", "простыней", "распрей", "скатертей",
          "тётей", "чукчей", "яслей", "барж", "басен", "башен", "брызг", "вафель", "дел", "копён", "кочерг", "кухонь", "макарон", "манжет", "нянь", "петель",
          "сабель", "серег", "сплетен", "туфель", "цапель", "шпрот", "яблонь", "бронхов", "георгинов", "дебатов", "заморозков", "консервов", "нервов", "комментариев", "сумерек", "сосисок", "штиблет", "колик"]

counter = 300
while True:
    if counter <= 0:
        break
    print(counter)
    a = random.randint(0, len(answer) - 1)
    print(answer[a])
    if questions[a] != input():
        print("=================================================")
        print(questions[a])
        counter += 1
        print("=================================================")
    else:
        print("молодец")
    counter -= 1
