import random

answer = ["невиданный", "негаданный", "читанный", "неожиданный", "обещанный", "считанный", "нетленный", "штукатуренный", "неслыханный", "жеманный", "желанный",
          "венчанный", "боронённый", "лелеянный", "чванный", "деланный", "нечаянный", "священный", "слышанный", "ставленный", "медленный", "черпанный", "мысленный",
          "чеканный", "смышлёный", "приданое", "жёваный", "кованый", "клёваный", "стираное", "глаженое", "переглаженое", "перестираное", "раненый", "израненный", "в ногу раненный",
           "проглоченный", "подаренный", "вытащенный", "сколоченный", "спрятанный", "построена", "замешанный", "построенный", "уничтоженная", "униженная",
           "игранный", "превращенный"]
questions = ["невида...ый", "негада...ый", "чита...ый", "неожида...ый", "обеща...ый", "счита...ый", "нетле...ый", "штукатуре...ый", "неслыха...ый", "жема...ый",
          "жела...ый", "венча...ый", "боронё...ый", "лелея...ый", "чва...ый", "дела...ый", "нечая...ый", "свяще...ый", "слыша...ый", "ставле...ый", "медле...ый",
             "черпа...ый", "мысле...ый", "чека...ый", "смышлё...ый", "прида...ое", "жёва...ый", "кова...ый", "клёва...ый", "стира...ое", "глаже...ое", "переглаже...ое",
             "перестира...ое", "ране...ый", "изране...ый", "в ногу ране...ый"]
questions2 = ["проглоче...ый", "подар...ый", "вытаще...ый", "сколоче...ый", "спрята...ый", "построе...а", "замеша...ый", "построе...ый", "уничтоже...ая", "униже...ая",
           "игра...ый", "превраще...ый"]


while True:
    unita = questions + questions2
    print(element := random.choice(unita))
    if answer[unita.index(element)] != input():
        print("=================================================")
        print(answer[unita.index(element)])
        if element in questions:
            print("исключение")
        print("=================================================")
    else:
        print("молодец")
        if element in questions:
            print("исключение")
        
